Revit 2017 API
DatumPlane.Maximize3DExtents Method
 Maximizes the 3d extents of the datum plane in all possible views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2016
Syntax
C#
public void Maximize3DExtents()
Visual Basic
Public Sub Maximize3DExtents
Visual C++
public:
void Maximize3DExtents()
See Also
DatumPlane Class
Autodesk.Revit.DB Namespace